package days03;

public class Ex07 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*[연산자 (operator)]
		 * 1. 정의 : 연산을 수행하는 기호
		 *    예) + - * / 등등
		 *    
		 * 2. 피연산자(operand) : 연산의 대상
		 *     2 + 5
		 * 
		 * 3. 조건식 : 참/거짓이 되는 표현식, 수식, 식, 표현식 
		 * : 연산자의 피연산자와를 조합하여 계산하고자하는 걸 표현한것.
		 * 
		 * 4. 연산자의 종류
		 *    1)피연산자의 갯수 분류
		 *       단항 연산자 
		 *       이항 연산자  2 + 3
		 *       삼항 연산자
		 *    
		 *    2)기능에 따라 분류
		 *    	산술연산자   2 + 3                      Ex07_02
		 *    	비교연산자   크고 작고, 같고 다름을 비교       Ex07_03
		 *    	논리연산자                              Ex07_04
		 *    	대입연산자								 Ex07_05
		 *    	조건연산자								 Ex07_06
		 *    	등등									 Ex07_07
		 * 
		 * */

	}

}
